[NoCoverage] BlockStatement
controllers/APICatController.js:6:37
 const router = express.Router();
 const { CAT_API_URL } = require("../../client/src/config");
 
-router.get("/", async (req, res) => {
-  try {
-    const response = await fetch(
-      `${CAT_API_URL}/images/search?limit=6&has_breeds=1`
-    );
-    if (!response.ok) {
-      throw new Error("Failed to fetch cats from external API");
-    }
-    const cats = await response.json();
-    res.json(cats);
-  } catch (error) {
-    console.error("Error fetching cats from external API:", error);
-    res.status(500).json({ error: "Failed to fetch cats from external API" });
-  }
-});
+router.get("/", async (req, res) => {});
 
 module.exports = router;

[NoCoverage] StringLiteral
controllers/APICatController.js:6:12
 const router = express.Router();
 const { CAT_API_URL } = require("../../client/src/config");
 
-router.get("/", async (req, res) => {
+router.get("", async (req, res) => {
   try {
     const response = await fetch(

[NoCoverage] BlockStatement
controllers/APICatController.js:7:7
 const { CAT_API_URL } = require("../../client/src/config");
 
 router.get("/", async (req, res) => {
-  try {
-    const response = await fetch(
-      `${CAT_API_URL}/images/search?limit=6&has_breeds=1`
-    );
-    if (!response.ok) {
-      throw new Error("Failed to fetch cats from external API");
-    }
-    const cats = await response.json();
-    res.json(cats);
-  } catch (error) {
+  try {} catch (error) {
     console.error("Error fetching cats from external API:", error);
     res.status(500).json({ error: "Failed to fetch cats from external API" });

[NoCoverage] StringLiteral
controllers/APICatController.js:9:7
 router.get("/", async (req, res) => {
   try {
     const response = await fetch(
-      `${CAT_API_URL}/images/search?limit=6&has_breeds=1`
+      ``
     );
     if (!response.ok) {

[NoCoverage] BooleanLiteral
controllers/APICatController.js:11:9
     const response = await fetch(
       `${CAT_API_URL}/images/search?limit=6&has_breeds=1`
     );
-    if (!response.ok) {
+    if (response.ok) {
       throw new Error("Failed to fetch cats from external API");
     }

[NoCoverage] BlockStatement
controllers/APICatController.js:11:23
     const response = await fetch(
       `${CAT_API_URL}/images/search?limit=6&has_breeds=1`
     );
-    if (!response.ok) {
-      throw new Error("Failed to fetch cats from external API");
-    }
+    if (!response.ok) {}
     const cats = await response.json();
     res.json(cats);

[NoCoverage] BlockStatement
controllers/APICatController.js:16:19
     }
     const cats = await response.json();
     res.json(cats);
-  } catch (error) {
-    console.error("Error fetching cats from external API:", error);
-    res.status(500).json({ error: "Failed to fetch cats from external API" });
-  }
+  } catch (error) {}
 });
 
