[NoCoverage] BlockStatement
controllers/catController.js:9:63
 module.exports = (app) => {
   const userRepository = getRepository(User);
 
-  app.get("/api/cats", authenticateToken, async (req, res) => {
-    try {
-      console.log("Fetching cats for user:", req.user.userId);
-      const userWithCats = await userRepository
-        .createQueryBuilder("user")
-        .leftJoinAndSelect("user.catsEntity", "cat")
-        .where("user.id = :id", { id: req.user.userId })
-        .getOne();
-
-      if (!userWithCats) {
-        console.log("User not found or no cats available");
-        res.status(404).json({ error: "User not found or no cats available" });
-        return;
-      }
-
-      res.json(userWithCats?.catsEntity || []);
-    } catch (error) {
-      console.error("Error fetching cats:", error);
-      res.status(500).json({ error: "Database error" });
-    }
-  });
+  app.get("/api/cats", authenticateToken, async (req, res) => {});
   app.post("/api/cats", authenticateToken, async (req, res) => {
     const { cats } = req.body;

[NoCoverage] BlockStatement
controllers/catController.js:10:9
   const userRepository = getRepository(User);
 
   app.get("/api/cats", authenticateToken, async (req, res) => {
-    try {
-      console.log("Fetching cats for user:", req.user.userId);
-      const userWithCats = await userRepository
-        .createQueryBuilder("user")
-        .leftJoinAndSelect("user.catsEntity", "cat")
-        .where("user.id = :id", { id: req.user.userId })
-        .getOne();
-
-      if (!userWithCats) {
-        console.log("User not found or no cats available");
-        res.status(404).json({ error: "User not found or no cats available" });
-        return;
-      }
-
-      res.json(userWithCats?.catsEntity || []);
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error fetching cats:", error);
       res.status(500).json({ error: "Database error" });

[NoCoverage] StringLiteral
controllers/catController.js:11:19
 
   app.get("/api/cats", authenticateToken, async (req, res) => {
     try {
-      console.log("Fetching cats for user:", req.user.userId);
+      console.log("", req.user.userId);
       const userWithCats = await userRepository
         .createQueryBuilder("user")

[NoCoverage] StringLiteral
controllers/catController.js:14:28
       console.log("Fetching cats for user:", req.user.userId);
       const userWithCats = await userRepository
         .createQueryBuilder("user")
-        .leftJoinAndSelect("user.catsEntity", "cat")
+        .leftJoinAndSelect("", "cat")
         .where("user.id = :id", { id: req.user.userId })
         .getOne();

[NoCoverage] ConditionalExpression
controllers/catController.js:18:11
         .where("user.id = :id", { id: req.user.userId })
         .getOne();
 
-      if (!userWithCats) {
+      if (false) {
         console.log("User not found or no cats available");
         res.status(404).json({ error: "User not found or no cats available" });

[NoCoverage] BlockStatement
controllers/catController.js:18:26
         .where("user.id = :id", { id: req.user.userId })
         .getOne();
 
-      if (!userWithCats) {
-        console.log("User not found or no cats available");
-        res.status(404).json({ error: "User not found or no cats available" });
-        return;
-      }
+      if (!userWithCats) {}
 
       res.json(userWithCats?.catsEntity || []);

[NoCoverage] ConditionalExpression
controllers/catController.js:24:16
         return;
       }
 
-      res.json(userWithCats?.catsEntity || []);
+      res.json(false);
     } catch (error) {
       console.error("Error fetching cats:", error);

[NoCoverage] ConditionalExpression
controllers/catController.js:24:16
         return;
       }
 
-      res.json(userWithCats?.catsEntity || []);
+      res.json(true);
     } catch (error) {
       console.error("Error fetching cats:", error);

[NoCoverage] BlockStatement
controllers/catController.js:25:21
       }
 
       res.json(userWithCats?.catsEntity || []);
-    } catch (error) {
-      console.error("Error fetching cats:", error);
-      res.status(500).json({ error: "Database error" });
-    }
+    } catch (error) {}
   });
   app.post("/api/cats", authenticateToken, async (req, res) => {

[NoCoverage] BlockStatement
controllers/catController.js:33:9
   app.post("/api/cats", authenticateToken, async (req, res) => {
     const { cats } = req.body;
 
-    try {
-      const user = await userRepository.findOne({
-        where: { id: req.user.userId },
-      });
-
-      if (!user) {
-        return res.status(404).json({ error: "User not found" });
-      }
-
-      const catRepository = getRepository(Cat);
-
-      await catRepository.delete({ user: { id: user.id } });
-
-      const newCats = cats.slice(0, 10).map((cat) =>
-        catRepository.create({
-          url: cat.url,
-          breed: cat.breed,
-          user: { id: user.id },
-        })
-      );
-
-      await catRepository.save(newCats);
-
-      res.json(newCats);
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error saving cats:", error);
       res.status(500).json({ error: "Database error" });

[NoCoverage] BlockStatement
controllers/catController.js:38:18
         where: { id: req.user.userId },
       });
 
-      if (!user) {
-        return res.status(404).json({ error: "User not found" });
-      }
+      if (!user) {}
 
       const catRepository = getRepository(Cat);

[NoCoverage] ObjectLiteral
controllers/catController.js:44:42
 
       const catRepository = getRepository(Cat);
 
-      await catRepository.delete({ user: { id: user.id } });
+      await catRepository.delete({ user: {} });
 
       const newCats = cats.slice(0, 10).map((cat) =>

[NoCoverage] MethodExpression
controllers/catController.js:46:23
 
       await catRepository.delete({ user: { id: user.id } });
 
-      const newCats = cats.slice(0, 10).map((cat) =>
+      const newCats = cats.map((cat) =>
         catRepository.create({
           url: cat.url,

[NoCoverage] ArrowFunction
controllers/catController.js:46:45
 
       await catRepository.delete({ user: { id: user.id } });
 
-      const newCats = cats.slice(0, 10).map((cat) =>
-        catRepository.create({
-          url: cat.url,
-          breed: cat.breed,
-          user: { id: user.id },
-        })
+      const newCats = cats.slice(0, 10).map(() => undefined
       );
 

[NoCoverage] BlockStatement
controllers/catController.js:57:21
       await catRepository.save(newCats);
 
       res.json(newCats);
-    } catch (error) {
-      console.error("Error saving cats:", error);
-      res.status(500).json({ error: "Database error" });
-    }
+    } catch (error) {}
   });
 };
