[Killed] ConditionalExpression
controllers/registerController.js:8:9
   app.post("/register", async (req, res) => {
     const { username, password } = req.body;
 
-    if (!username || !password) {
+    if (false) {
       return res
         .status(400)
killedBy: Auth Integration should register and login user
statusReason: QueryFailedError: отношение "user" не существует

[Killed] BooleanLiteral
controllers/registerController.js:8:9
   app.post("/register", async (req, res) => {
     const { username, password } = req.body;
 
-    if (!username || !password) {
+    if (username || !password) {
       return res
         .status(400)
killedBy: Auth Integration should register and login user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[NoCoverage] ObjectLiteral
controllers/registerController.js:11:15
     if (!username || !password) {
       return res
         .status(400)
-        .json({ error: "Username and password are required" });
+        .json({});
     }
 

[Killed] BlockStatement
controllers/registerController.js:14:9
         .json({ error: "Username and password are required" });
     }
 
-    try {
-      const existingUser = await userRepository.findOne({
-        where: { username },
-      });
-      if (existingUser) {
-        return res.status(400).json({
-          error: "Username already taken",
-        });
-      }
-
-      const hashedPassword = await bcrypt.hash(password, 10);
-
-      const user = new User();
-      user.username = username;
-      user.password = hashedPassword;
-      user.todos = [];
-      user.cats = [];
-      await userRepository.save(user);
-
-      res.status(201).json({ message: "User registered successfully" });
-    } catch (error) {
+    try {} catch (error) {
       console.error("Database error:", error);
       res.status(500).json({ error: "Database error" });
killedBy: Auth Integration should register and login user
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
controllers/registerController.js:18:11
       const existingUser = await userRepository.findOne({
         where: { username },
       });
-      if (existingUser) {
+      if (false) {
         return res.status(400).json({
           error: "Username already taken",
killedBy: Auth Integration should register and login user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ConditionalExpression
controllers/registerController.js:18:11
       const existingUser = await userRepository.findOne({
         where: { username },
       });
-      if (existingUser) {
+      if (true) {
         return res.status(400).json({
           error: "Username already taken",
killedBy: Auth Integration should register and login user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ObjectLiteral
controllers/registerController.js:19:37
         where: { username },
       });
       if (existingUser) {
-        return res.status(400).json({
-          error: "Username already taken",
-        });
+        return res.status(400).json({});
       }
 
killedBy: Auth Integration should not allow duplicate usernames
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Username already taken"
Received: undefined

[NoCoverage] BlockStatement
controllers/registerController.js:34:21
       await userRepository.save(user);
 
       res.status(201).json({ message: "User registered successfully" });
-    } catch (error) {
-      console.error("Database error:", error);
-      res.status(500).json({ error: "Database error" });
-    }
+    } catch (error) {}
   });
 };
