[Killed] BlockStatement
controllers/taskController.js:10:60
 module.exports = (app) => {
   const userRepository = getRepository(User);
 
-  app.get("/tasks", authenticateToken, async (req, res) => {
-    try {
-      const tasks = await userRepository
-        .createQueryBuilder("user")
-        .leftJoinAndSelect("user.tasks", "task")
-        .where("user.id = :id", { id: req.user.userId })
-        .getOne();
-
-      res.json(tasks?.tasks || []);
-    } catch (error) {
-      console.error("Error fetching tasks:", error);
-      res.status(500).json({ error: "Database error" });
-    }
-  });
+  app.get("/tasks", authenticateToken, async (req, res) => {});
   app.post("/tasks", authenticateToken, async (req, res) => {
     const todos = req.body.tasks;
killedBy: Auth Integration should register and login user
statusReason: QueryFailedError: отношение "tasks" не существует

[Killed] BlockStatement
controllers/taskController.js:11:9
   const userRepository = getRepository(User);
 
   app.get("/tasks", authenticateToken, async (req, res) => {
-    try {
-      const tasks = await userRepository
-        .createQueryBuilder("user")
-        .leftJoinAndSelect("user.tasks", "task")
-        .where("user.id = :id", { id: req.user.userId })
-        .getOne();
-
-      res.json(tasks?.tasks || []);
-    } catch (error) {
+    try {} catch (error) {
       console.error("Error fetching tasks:", error);
       res.status(500).json({ error: "Database error" });
killedBy: Auth Integration should register and login user
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] OptionalChaining
controllers/taskController.js:18:16
         .where("user.id = :id", { id: req.user.userId })
         .getOne();
 
-      res.json(tasks?.tasks || []);
+      res.json(tasks.tasks || []);
     } catch (error) {
       console.error("Error fetching tasks:", error);
killedBy: Auth Integration should register and login user
statusReason: QueryFailedError: повторяющееся значение ключа нарушает ограничение уникальности "pg_class_relname_nsp_index"

[Killed] ConditionalExpression
controllers/taskController.js:18:16
         .where("user.id = :id", { id: req.user.userId })
         .getOne();
 
-      res.json(tasks?.tasks || []);
+      res.json(false);
     } catch (error) {
       console.error("Error fetching tasks:", error);
killedBy: Auth Integration should register and login user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[NoCoverage] BlockStatement
controllers/taskController.js:19:21
         .getOne();
 
       res.json(tasks?.tasks || []);
-    } catch (error) {
-      console.error("Error fetching tasks:", error);
-      res.status(500).json({ error: "Database error" });
-    }
+    } catch (error) {}
   });
   app.post("/tasks", authenticateToken, async (req, res) => {

[NoCoverage] ObjectLiteral
controllers/taskController.js:21:28
       res.json(tasks?.tasks || []);
     } catch (error) {
       console.error("Error fetching tasks:", error);
-      res.status(500).json({ error: "Database error" });
+      res.status(500).json({});
     }
   });

[NoCoverage] StringLiteral
controllers/taskController.js:21:37
       res.json(tasks?.tasks || []);
     } catch (error) {
       console.error("Error fetching tasks:", error);
-      res.status(500).json({ error: "Database error" });
+      res.status(500).json({ error: "" });
     }
   });

[NoCoverage] ObjectLiteral
controllers/taskController.js:30:49
     console.log("Received todos:", todos);
 
     try {
-      const user = await userRepository.findOne({
-        where: { id: req.user.userId },
-        relations: ["tasks"],
-      });
+      const user = await userRepository.findOne({});
 
       if (!user) {

[NoCoverage] StringLiteral
controllers/taskController.js:32:21
     try {
       const user = await userRepository.findOne({
         where: { id: req.user.userId },
-        relations: ["tasks"],
+        relations: [""],
       });
 

[NoCoverage] ArrayDeclaration
controllers/taskController.js:32:20
     try {
       const user = await userRepository.findOne({
         where: { id: req.user.userId },
-        relations: ["tasks"],
+        relations: [],
       });
 

[NoCoverage] StringLiteral
controllers/taskController.js:37:46
 
       if (!user) {
         console.log("User not found:", req.user.userId);
-        return res.status(404).json({ error: "User not found" });
+        return res.status(404).json({ error: "" });
       }
 

[NoCoverage] ObjectLiteral
controllers/taskController.js:37:37
 
       if (!user) {
         console.log("User not found:", req.user.userId);
-        return res.status(404).json({ error: "User not found" });
+        return res.status(404).json({});
       }
 

[NoCoverage] ArrowFunction
controllers/taskController.js:44:31
 
       await taskRepository.delete({ user: user.id });
 
-      const tasks = todos.map((todo) =>
-        taskRepository.create({
-          text: todo.text,
-          status: todo.status,
-          user: user.id,
-        })
+      const tasks = todos.map(() => undefined
       );
 

[NoCoverage] BlockStatement
controllers/taskController.js:54:21
 
       await taskRepository.save(tasks);
       res.sendStatus(200);
-    } catch (error) {
-      console.error("Error saving tasks:", error);
-      res.status(500).json({ error: "Database error" });
-    }
+    } catch (error) {}
   });
 };

[NoCoverage] ObjectLiteral
controllers/taskController.js:56:28
       res.sendStatus(200);
     } catch (error) {
       console.error("Error saving tasks:", error);
-      res.status(500).json({ error: "Database error" });
+      res.status(500).json({});
     }
   });
