[NoCoverage] BlockStatement
controllers/testController.js:3:27
 const { getConnection } = require("typeorm");
 
-module.exports = (app) => {
-  app.post("/test/cleanup", async (req, res) => {
-    try {
-      const connection = getConnection();
-      await connection.query("TRUNCATE TABLE tasks CASCADE");
-      await connection.query("TRUNCATE TABLE cats CASCADE");
-      await connection.query('TRUNCATE TABLE "user" CASCADE');
-      res.sendStatus(200);
-    } catch (error) {
-      console.error("Test cleanup failed:", error);
-      res.sendStatus(500);
-    }
-  });
-};
+module.exports = (app) => {};
 

[NoCoverage] BlockStatement
controllers/testController.js:4:49
 const { getConnection } = require("typeorm");
 
 module.exports = (app) => {
-  app.post("/test/cleanup", async (req, res) => {
-    try {
-      const connection = getConnection();
-      await connection.query("TRUNCATE TABLE tasks CASCADE");
-      await connection.query("TRUNCATE TABLE cats CASCADE");
-      await connection.query('TRUNCATE TABLE "user" CASCADE');
-      res.sendStatus(200);
-    } catch (error) {
-      console.error("Test cleanup failed:", error);
-      res.sendStatus(500);
-    }
-  });
+  app.post("/test/cleanup", async (req, res) => {});
 };
 

[NoCoverage] StringLiteral
controllers/testController.js:4:12
 const { getConnection } = require("typeorm");
 
 module.exports = (app) => {
-  app.post("/test/cleanup", async (req, res) => {
+  app.post("", async (req, res) => {
     try {
       const connection = getConnection();

[NoCoverage] BlockStatement
controllers/testController.js:5:9
 
 module.exports = (app) => {
   app.post("/test/cleanup", async (req, res) => {
-    try {
-      const connection = getConnection();
-      await connection.query("TRUNCATE TABLE tasks CASCADE");
-      await connection.query("TRUNCATE TABLE cats CASCADE");
-      await connection.query('TRUNCATE TABLE "user" CASCADE');
-      res.sendStatus(200);
-    } catch (error) {
+    try {} catch (error) {
       console.error("Test cleanup failed:", error);
       res.sendStatus(500);

[NoCoverage] BlockStatement
controllers/testController.js:11:21
       await connection.query("TRUNCATE TABLE cats CASCADE");
       await connection.query('TRUNCATE TABLE "user" CASCADE');
       res.sendStatus(200);
-    } catch (error) {
-      console.error("Test cleanup failed:", error);
-      res.sendStatus(500);
-    }
+    } catch (error) {}
   });
 };

[NoCoverage] StringLiteral
controllers/testController.js:12:21
       await connection.query('TRUNCATE TABLE "user" CASCADE');
       res.sendStatus(200);
     } catch (error) {
-      console.error("Test cleanup failed:", error);
+      console.error("", error);
       res.sendStatus(500);
     }
