[Killed] BlockStatement
controllers/loginController.js:10:33
   app.post("/login", async (req, res) => {
     const { username, password } = req.body;
 
-    if (!username || !password) {
-      return res
-        .status(400)
-        .json({ error: "Username and password are required" });
-    }
+    if (!username || !password) {}
 
     try {
killedBy: Login Controller POST /login should return 400 if username is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] ConditionalExpression
controllers/loginController.js:10:9
   app.post("/login", async (req, res) => {
     const { username, password } = req.body;
 
-    if (!username || !password) {
+    if (true) {
       return res
         .status(400)
killedBy: Login Controller POST /login should return 404 if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Timeout] BlockStatement
controllers/loginController.js:16:9
         .json({ error: "Username and password are required" });
     }
 
-    try {
-      const user = await userRepository.findOne({ where: { username } });
-      if (!user) {
-        return res.status(404).json({ error: "User does not exist" });
-      }
-
-      const isValidPassword = await bcrypt.compare(password, user.password);
-      if (!isValidPassword) {
-        return res.status(401).json({ error: "Incorrect password" });
-      }
-
-      const token = jwt.sign({ userId: user.id }, secretKey, {
-        expiresIn: "1h",
-      });
-
-      res.json({ token });
-    } catch (error) {
+    try {} catch (error) {
       console.error(error);
       res.status(500).json({ error: "Database error" });

[Killed] ObjectLiteral
controllers/loginController.js:17:58
     }
 
     try {
-      const user = await userRepository.findOne({ where: { username } });
+      const user = await userRepository.findOne({ where: {} });
       if (!user) {
         return res.status(404).json({ error: "User does not exist" });
killedBy: Login Controller POST /login should return 404 if user does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "username": "nonexistent",

[Killed] ObjectLiteral
controllers/loginController.js:17:49
     }
 
     try {
-      const user = await userRepository.findOne({ where: { username } });
+      const user = await userRepository.findOne({});
       if (!user) {
         return res.status(404).json({ error: "User does not exist" });
killedBy: Login Controller POST /login should return 404 if user does not exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "username": "nonexistent",

[Killed] BooleanLiteral
controllers/loginController.js:18:11
 
     try {
       const user = await userRepository.findOne({ where: { username } });
-      if (!user) {
+      if (user) {
         return res.status(404).json({ error: "User does not exist" });
       }
killedBy: Login Controller POST /login should return 404 if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] BlockStatement
controllers/loginController.js:18:18
 
     try {
       const user = await userRepository.findOne({ where: { username } });
-      if (!user) {
-        return res.status(404).json({ error: "User does not exist" });
-      }
+      if (!user) {}
 
       const isValidPassword = await bcrypt.compare(password, user.password);
killedBy: Login Controller POST /login should return 404 if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ObjectLiteral
controllers/loginController.js:19:37
     try {
       const user = await userRepository.findOne({ where: { username } });
       if (!user) {
-        return res.status(404).json({ error: "User does not exist" });
+        return res.status(404).json({});
       }
 
killedBy: Login Controller POST /login should return 404 if user does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "User does not exist"
Received: undefined

[Killed] ConditionalExpression
controllers/loginController.js:23:11
       }
 
       const isValidPassword = await bcrypt.compare(password, user.password);
-      if (!isValidPassword) {
+      if (false) {
         return res.status(401).json({ error: "Incorrect password" });
       }
killedBy: Login Controller POST /login should return 401 if password is incorrect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] BlockStatement
controllers/loginController.js:23:29
       }
 
       const isValidPassword = await bcrypt.compare(password, user.password);
-      if (!isValidPassword) {
-        return res.status(401).json({ error: "Incorrect password" });
-      }
+      if (!isValidPassword) {}
 
       const token = jwt.sign({ userId: user.id }, secretKey, {
killedBy: Login Controller POST /login should return 401 if password is incorrect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 401
Received: 200

[Killed] ObjectLiteral
controllers/loginController.js:24:37
 
       const isValidPassword = await bcrypt.compare(password, user.password);
       if (!isValidPassword) {
-        return res.status(401).json({ error: "Incorrect password" });
+        return res.status(401).json({});
       }
 
killedBy: Login Controller POST /login should return 401 if password is incorrect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Incorrect password"
Received: undefined

[Killed] ObjectLiteral
controllers/loginController.js:27:30
         return res.status(401).json({ error: "Incorrect password" });
       }
 
-      const token = jwt.sign({ userId: user.id }, secretKey, {
+      const token = jwt.sign({}, secretKey, {
         expiresIn: "1h",
       });
killedBy: Login Controller POST /login should return JWT token for valid credentials
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "userId": 1,
- }

[Killed] StringLiteral
controllers/loginController.js:28:20
       }
 
       const token = jwt.sign({ userId: user.id }, secretKey, {
-        expiresIn: "1h",
+        expiresIn: "",
       });
 
killedBy: Login Controller POST /login should return JWT token for valid credentials
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {"userId": 1},
  undefined,
  Object {

[Killed] ObjectLiteral
controllers/loginController.js:31:16
         expiresIn: "1h",
       });
 
-      res.json({ token });
+      res.json({});
     } catch (error) {
       console.error(error);
killedBy: Login Controller POST /login should return JWT token for valid credentials
statusReason: Error: expect(received).toHaveProperty(path, value)

Expected path: "token"
Received path: []

Expected value: "mock.jwt.token"
Received value: {}

[Killed] BlockStatement
controllers/loginController.js:32:21
       });
 
       res.json({ token });
-    } catch (error) {
-      console.error(error);
-      res.status(500).json({ error: "Database error" });
-    }
+    } catch (error) {}
   });
 };
killedBy: Login Controller POST /login should return 500 if database error occurs
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
controllers/loginController.js:34:37
       res.json({ token });
     } catch (error) {
       console.error(error);
-      res.status(500).json({ error: "Database error" });
+      res.status(500).json({ error: "" });
     }
   });
killedBy: Login Controller POST /login should return 500 if database error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Database error"
Received: ""

[Killed] ObjectLiteral
controllers/loginController.js:34:28
       res.json({ token });
     } catch (error) {
       console.error(error);
-      res.status(500).json({ error: "Database error" });
+      res.status(500).json({});
     }
   });
killedBy: Login Controller POST /login should return 500 if database error occurs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Database error"
Received: undefined
